Repository: autohotkey-docs-translation/v1-es
Catalog: omegat/project_save.tmx
Source language: en
Languages: es

source: "AutoHotkey Help",,,"docs\AutoHotkey.htm","docs\AutoHotkey.htm",,,,,0x73500,,0x10200e,[200,0,1080,700],,,,,3,,0
es: "Ayuda para AutoHotkey",,,"docs\AutoHotkey.htm","docs\AutoHotkey.htm",,,,,0x73500,,0x10200e,[200,0,1080,700],,,,,3,,0

source: "en":true,
es: "en":"es",

source: "https://github.com/Lexikos/AutoHotkey_L-Docs/edit/master/docs/":true,
es: "https://github.com/Lexikos/AutoHotkey_L-Docs/edit/master/docs/":"https://github.com/ahkscript/AHK-Docs_ES/edit/master/target/docs/",

source: 1 - The Basics
es: 1 - Primeros Pasos

source: ::ftw::Free the whales
es: ::salb::Salvad a las ballenas

source: Concepts and conventions:
es: Conceptos y convenciones:

source: In section 5 we'll talk about why it doesn't work as you might expect and what you can do instead.
es: En la sección 5 hablaremos sobre por qué no funciona como cabría esperar y qué puedes hacer en su lugar.

source: Script compatibility - AutoHotkey 1.0 users read this
es: Compatibilidad de scripts - los usuarios de AutoHotkey 1.0 leen esto

source: Scripting language:
es: Lenguaje de scripting:

source: Send, My First Script is how you send keystrokes.
es: Send, Mi Primer Script es la forma en que se envían pulsaciones de teclas (keystrokes).

source: ^j:: is the hotkey.
es: ^j:: es la hotkey.

source: ^ means Ctrl, j is the letter J.
es: ^ significa Ctrl, j es la letra J.

source: Send is the command, anything after the comma (,) will be typed.
es: Send es el comando, cualquier cosa después de la coma (,) será tecleado.

source: A hotkey is a key that is hot to the touch.
es: Una hotkey es una tecla que está caliente al tacto.

source: A special thanks to Jonathan Bennett, whose generosity in releasing AutoIt v2 as free software in 1999 served as an inspiration and time-saver for myself and many others worldwide.
es: Un agradecimiento especial a Jonathan Bennett, cuya generosidad al lanzar AutoIt v2 como software libre en 1999 me sirvió de inspiración y de ahorro de tiempo para mí y para muchos otros en todo el mundo.

source: A window should have popped up, probably Notepad.
es: 7.Debería haber aparecido una ventana, probablemente el Bloc de notas.

source: Acknowledgements
es: Agradecimientos

source: After downloading it, you may possibly need to install it.
es: Después de descargarlo, posiblemente tendrás que instalarlo.

source: Anything to the left of :: are the keys you need to press.
es: Cualquier cosa a la izquierda de :: son las teclas que tienes que presionar.

source: Asking for Help
es: Pidiendo Ayuda

source: AutoHotkey Beginner Tutorial by tidbit
es: Tutorial de AutoHotkey para Principiantes by tidbit

source: AutoHotkey Help
es: Ayuda para AutoHotkey

source: AutoHotkey is not magic, we all wish it was, but it is not.
es: AutoHotkey no es mágico, a todos nos gustaría que lo fuese, pero no lo es.

source: Before learning to use AutoHotkey (AHK), you will need to download it.
es: Antes de aprender a usar AutoHotkey (AHK), tendrás que descargarlo.

source: Before we begin our journey, let me give some advice.
es: Antes de comenzar nuestro viaje, permíteme darte algunos consejos.

source: Beginner Tutorial | AutoHotkey
es: Tutorial Para Principiantes | AutoHotkey

source: But that depends on the version you want.
es: Pero eso depende de la versión que quieras.

source: Click "AutoHotkey Script" inside the "New" menu.
es: Haz click en "AutoHotkey Script" dentro del menú "Nuevo".

source: Click "Edit Script".
es: Haz click en "Edit Script".

source: Click Programs or All Programs.
es: Haz click en Programas or Todos los Programas.

source: Click Download:
es: Haz click en Download:

source: Click it.
es: Haz click en él.

source: Code blocks
es: Bloques de código

source: Command and function list
es: Lista de comandos y funciones

source: Commands vs. Functions()
es: Comandos vs. Functions()

source: Continue on to section b.
es: Continúa con la sección b.

source: Creating Objects
es: Creando Objetos

source: Done!
es: ¡Hecho!

source: Double-click the file/icon in the desktop to run it.
es: Haz doble click en el archivo/icono en el escritorio para ejecutarlo.

source: Downloading and installing AutoHotkey
es: Descargando e instalando AutoHotkey

source: During installation of AutoHotkey, you will be asked to choose from UNICODE or ANSI.
es: Durante la instalación de AutoHotkey, se te pedirá que elijas entre UNICODE o ANSI.

source: Examples
es: Ejemplos

source: Finally, AutoHotkey would not be what it is today without these other individuals.
es: Finalmente, AutoHotkey no sería lo que es hoy sin estos otros individuos.

source: Find "New" in the menu.
es: Encuentra "Nuevo" en el menú.

source: Find AutoHotkey in the list.
es: Busca AutoHotkey en la lista.

source: Find My Computer or Computer.
es: Busca Mi Ordenador o Ordenador.

source: Find the Start menu or Start Orb on your screen, usually in the lower left.
es: Busca el menú Inicio, normalmente en la parte inferior izquierda.

source: Find the newly created file on your desktop and right-click it.
es: Encuentra el archivo recién creado en tu escritorio y haz click derecho sobre él.

source: Finding your AHK version
es: Encontrando tu versión de AHK

source: For a list of all built-in commands, function and variables, see section 5.
es: Para obtener una lista con todos los comandos,funciones y variables integrados, consulta la sección 5.

source: For a video instruction, watch Install and Hello World on YouTube.
es: Para una instrucción en video, mira Install and Hello World en YouTube.

source: For example:
es: Por ejemplo:

source: For optimal learning power, it is advised that you read the text and try the code.
es: Para un aprendizaje óptimo, se recomienda leer el texto y probar el código.

source: For this guide we will use the Installer since it is easiest to set up.
es: Para esta guía usaremos el instalador, ya que es más fácil de configurar.

source: Frequently asked questions
es: Preguntas frecuentes

source: Functions
es: Funciones

source: Games
es: Juegos

source: Getting started:
es: Empezando:

source: Getting user input
es: Obtener información del usuario

source: Give the script a new name.
es: Dale un nombre al script.

source: Go get some reward snacks then return to reading the rest of this tutorial.
es: Ve a por unos aperitivos de recompensa y vuelve a leer el resto de este tutorial.

source: Go into your harddrive that contains AutoHotkey.
es: Ve al disco duro que contiene AutoHotkey.

source: Go to the AutoHotkey Homepage:
es: Ve a la Página Principal de AutoHotkey:

source: Go to your desktop.
es: Ve a tu escritorio.

source: Here is a very basic script containing a hotkey which types text using the Send command when the hotkey is pressed:
es: Aquí hay un script muy básico que contiene una hotkey (tecla de acceso rápido) que escribe texto usando el comando Send cuandola hotkey is presionada:

source: Hip Hip Hooray!
es: ¡Hip Hip Hurra!

source: Hotkeys (mouse, joystick and keyboard shortcuts)
es: Hotkeys (atajos de ratón, joystick y teclado)

source: Hotstrings and auto-replace
es: Hotstrings y reemplazo automático

source: Hotstrings are mainly used to expand abbreviations as you type them (auto-replace), they can also be used to launch any scripted action.
es: Los hotstrings se utilizan principalmente para expandir abreviaturas a medida que escribes (reemplazo automático). También se pueden usar para iniciar cualquier acción programada.

source: How to create a script
es: Cómo crear un script

source: How to find the help file on your computer
es: Cómo encontrar el archivo de ayuda en tuordenador

source: How to use the program
es: Cómo utilizar el programa

source: If so, SUCCESS!
es: Si esasí, ¡ÉXITO!

source: If you get confused, try reading the section again.
es: Si te quedas confundido, trata de leer la sección nuevamente.

source: In addition, many of AutoHotkey's enhancements to the AutoIt v2 command set, as well as the Window Spy and the old script compiler, were adapted directly from the AutoIt v3 source code.
es: Además, muchas de las mejoras de AutoHotkey al conjunto de comandos de AutoIt v2, así como Window Spy y el antiguo compilador de scripts, se adaptaron directamente del código fuente de AutoIt v3.

source: In short, you would probably want to choose UNICODE.
es: En resumen, probablemente querrás elegir UNICODE.

source: Indentation
es: Indentación

source: Interactive debugging
es: Depuración interactiva

source: It has support for non-English letters and numbers (characters).
es: Tiene soporte para letras y números (caracteres) no ingleses.

source: It is a key or key combination that the person at the keyboard presses to trigger some actions.
es: Es una tecla o combinación de teclas que la persona presiona en el teclado para activar algunas acciones.

source: It literally stops code from going any further, to the lines below.
es: Literalmente impide que el código vaya más allá, a las líneas siguientes.

source: It must end with a .ahk extension.
es: Debe terminar con unaextensión .ahk.

source: Just kidding.
es: Es broma.

source: Keep going until you see an Install button.
es: Continúa hasta que veas un botón Install.

source: Keyboard and mouse:
es: Teclado y ratón:

source: Keys and their mysterious symbols
es: Las teclas y sus misteriosos símbolos

source: Learn how to download and install AutoHotkey, to create a script, to use hotkeys and hotstrings, to send keystrokes, to run programs, etc.
es: Aprende a descargar e instalar AutoHotkey, a crear un script, a usar hotkeys (teclas de acceso rápido) y hotstrings (cadenas de auto-reemplazo), a enviar pulsaciones de teclas, a ejecutar programas, etc.

source: List of keys, mouse buttons and joystick controls
es: Lista de teclas, botones del mouse y controles de joystick

source: Look for AutoHotkey.chm or a file that says AutoHotkey and has a yellow question mark on it.
es: Busca AutoHotkey.chm o un archivo que diga AutoHotkey y tenga un signo de interrogación amarillo.

source: Method 1:
es: Método 1:

source: Method 2:
es: Método 2:

source: Miscellaneous topics
es: Temas diversos

source: Multiple hotkeys/hotstrings per file
es: Múltiples hotkeys/hotstrings por archivo

source: MyScript.ahk
es: MiScript.ahk

source: Objects
es: Objetos

source: Once done, great!
es: Una vez hecho esto, ¡genial!

source: Once you have AutoHotkey installed, you will probably want it to do stuff.
es: Una vez que tengas AutoHotkey instalado, probablemente querrás que haga cosas.

source: Open it.
es: Ábrelo.

source: Open notepad or (anything you can type in) and press Ctrl and J.
es: Abre el bloc de notas (o cualquier cosa en la que puedas escribir) y presiona Ctrl y J.

source: Other Examples?
es: ¿Otros ejemplos?

source: Other Helpful Goodies
es: Otras Cosillas Útiles

source: Other links
es: Otros enlaces

source: Other:
es: Otro:

source: Probably C:\ drive.
es: Probablemente, la unidad C:\.

source: Quick Reference
es: Referencia Rápida

source: Quick Reference | AutoHotkey
es: Referencia Rápida | AutoHotkey

source: RegEx quick reference
es: Referencia rápida de RegEx

source: Remapping keys and buttons
es: Reasignación de teclas y botones

source: Right-Click on your desktop.
es: Haz click derecho en tu escritorio.

source: Running Programs & Websites
es: Ejecutando Programas & Sitios Web

source: Save the File.
es: Guarda el archivo.

source: Search within all Program Files folders for AutoHotkey.
es: Busca AutoHotkey entre todas las carpetas de Archivos de Programa .

source: Send, My First Script
es: Send, Mi Primer Script

source: Sending Keystrokes
es: Enviando Keystrokes (pulsaciones de teclas)

source: Since you're viewing this documentation locally, you've probably already installed AutoHotkey and can skip to section b.
es: Dado que estás viendo esta documentación localmente, probablemente ya hayas instalado AutoHotkey y puedes pasar a la sección b.

source: So now that you have created a script, we need to add stuff into the file.
es: Así que, ahora que has creado un script, tenemos que añadir cosasen el archivo.

source: So thanks to Jon and the other AutoIt authors for those as well.
es: Así que gracias a Jon y a los otros autores de AutoIt por ello.

source: So we will need to tell it what to do.
es: Así que tendremos que decirle qué hacer.

source: Software License:
es: Licencia de Software:

source: Table of Contents
es: Tabla de contenidos

source: Text editors with AutoHotkey support
es: Editores de texto con soporte para AutoHotkey

source: Text instructions:
es: Instrucciones de texto:

source: The Basics
es: Primeros Pasos

source: The first line:
es: La primera línea:

source: The mysterious square brackets
es: Los misteriosos corchetes

source: The second line:
es: La segunda línea

source: The third line:
es: La tercera línea:

source: Then, study the code.
es: Después, estudia el código.

source: There are a few ways to do this, I'll assume you have it installed to the default locations:
es: Hay varias maneras de hacerlo: Supongamos que lo tienes instalado en las instalaciones predeterminadas:

source: This page contains information about the currently used version, the authors, the license, and a quick overview of the documentation.
es: Esta página contiene información sobre la versión utilizada actualmente, los autores, la licencia y una descripción general rápida de la documentación .

source: This process is called "Scripting".
es: A este proceso se le llama "Scripting".

source: This will become your best friend.
es: Éste se convertirá en tu mejor amigo.

source: This will prevent many issues when you start having a lot of stuff in your scripts.
es: Esto evitarámuchos problemas cuando empieces a tener un montón decosas en tus scripts.

source: Throughout this tutorial you will see a lot of text and a lot of code.
es: A lo largo de este tutorial, verás mucho texto y mucho código.

source: Trial and Error
es: Prueba y Error

source: Tutorial for beginners
es: Tutorial para principiantes

source: Until then, here's an explanation of the above code:
es: Hasta entonces, aquí hayuna explicación del código anterior:

source: Using Objects
es: Usando Objetos

source: Variables and expressions
es: Variables and expresiones

source: Version
es: Versión

source: We will get more in-depth later on.
es: Luego profundizaremos más.

source: What is a hotkey?
es: ¿Qué es una hotkey?

source: What is a hotstring?
es: ¿Qué es un hotstring?

source: When to use percents
es: Cuándo usar porcentajes

source: When you are making your code, you might have the urge to put several commands on the same line or inside of each other, don't.
es: Cuando estés creando tu código, quizá sientas la necesidad de poner varios comandos en la misma línea o uno dentro del otro: no lo hagas.

source: Window specific hotkeys/hotstrings
es: b.Hotkeys/hotstrings para una ventana específica

source: You can copy and paste most examples on this page.
es: Puedes copiar y pegar la mayoría de los ejemplos de esta página.

source: You cannot merge commands
es: No puedes combinar comandos

source: You should then see AutoHotkey Help File.
es: Ahí deberás ver el Archivo de Ayuda de AutoHotkey (AutoHotkey Help File).

source: Your first script is done.
es: Tu primer script está hecho.

source: ahk, autohotkey, tutorial, beginners guide
es: ahk, autohotkey, tutorial, guía para principiantes

source: en
es: es

source: explanations of various things you need to know.
es: explicaciones de varias cosas que necesitas saber.

source: how to write scripts.
es: Cómo escribir scripts.

source: ©2003-2014 Chris Mallett, portions ©AutoIt Team and the AHK community
es: ©2003-2014 Chris Mallett, porciones ©AutoIt Team y la comunidad de AHK - Traducción: LordYoElGrande
